___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

<img src=https://i.ibb.co/wJW61Y2/Used-cars.jpg width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">The Capstone Project of Data Analytics Module</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Car Price Prediction EDA</p>

## Introduction
Welcome to "***AutoScout Data Analysis Project***". This is the capstone project of ***Data Analysis*** Module. **Auto Scout** data which using for this project, scraped from the on-line car trading company in 2019, contains many features of 9 different car models. In this project, you will have the opportunity to apply many commonly used algorithms for Data Cleaning and Exploratory Data Analysis by using many Python libraries such as Numpy, Pandas, Matplotlib, Seaborn, Scipy you will analyze clean dataset.

### Some Reminders on Exploratory data analysis (EDA)

Exploratory data analysis (EDA) is an especially important activity in the routine of a data analyst or scientist. It enables an in depth understanding of the dataset, define or discard hypotheses and create predictive models on a solid basis. It uses data manipulation techniques and several statistical tools to describe and understand the relationship between variables and how these can impact business. By means of EDA, we can obtain meaningful insights that can impact analysis under the following questions (If a checklist is good enough for pilots to use every flight, it’s good enough for data scientists to use with every dataset).
1. What question are you trying to solve (or prove wrong)?
2. What kind of data do you have?
3. What’s missing from the data?
4. Where are the outliers?
5. How can you add, change or remove features to get more out of your data?

**``Exploratory data analysis (EDA)``** is often an **iterative brainstorming process** where you pose a question, review the data, and develop further questions to investigate before beginning model development work. The image below shows how the brainstorming phase is connected with that of understanding the variables and how this in turn is connected again with the brainstorming phase.<br>

<img src=https://i.ibb.co/k0MC950/EDA-Process.png width="300" height="100">

[Image Credit: Andrew D.](https://towardsdatascience.com/exploratory-data-analysis-in-python-a-step-by-step-process-d0dfa6bf94ee)

**``In this context, the project consists of 3 parts in general:``**
* **The first part** is related to 'Data Cleaning'. It deals with Incorrect Headers, Incorrect Format, Anomalies, and Dropping useless columns.
* **The second part** is related to 'Filling Data', in other words 'Imputation'. It deals with Missing Values. Categorical to numeric transformation is done as well.
* **The third part** is related to 'Handling Outliers of Data' via Visualization libraries. So, some insights will be extracted.

**``NOTE:``**  However, you are free to create your own style. You do NOT have to stick to the steps above. We, the DA & DV instructors, recommend you study each part separately to create a source notebook for each part title for your further studies.

## PART- 2 `( Handling With Missing Vales )`

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns 
import matplotlib.pyplot as plt
from scipy import stats
from scipy.stats.mstats import winsorize

import warnings
warnings.filterwarnings("ignore")
warnings.warn("this will not show")

%matplotlib inline

plt.rcParams["figure.figsize"] = (10,6)

sns.set_style("whitegrid")
pd.set_option('display.float_format', lambda x: '%.2f' % x)

pd.options.display.max_rows = 100
pd.options.display.max_columns = 100

In [2]:
df = pd.read_csv("clean_scout.csv")

In [3]:
df.shape

(15919, 33)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15919 entries, 0 to 15918
Data columns (total 33 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   make_model           15919 non-null  object
 1   body_type            15859 non-null  object
 2   price                15919 non-null  int64
 3   vat                  11406 non-null  object
 4   km                   14895 non-null  float64
 5   hp_kw                15831 non-null  float64
 6   type                 15917 non-null  object
 7   previous_owners      9279 non-null   float64
 8   inspection_new       3932 non-null   object
 9   warranty             4853 non-null   float64
 10  age                  14322 non-null  float64
 11  body_color           15322 non-null  object
 12  paint_type           10147 non-null  object
 13  upholstery_type      11048 non-null  object
 14  upholstery_color     10841 non-null  object
 15  nr_of_doors          15707 non-null  float64
 16  nr_of_seats          14942 non-null  float64
 17  gearing_type         15919 non-null  object
 18  displacement_cc      15423 non-null  float64
 19  cylinders            10239 non-null  float64
 20  weight_kg            8945 non-null   float64
 21  drive_chain          9061 non-null   object
 22  fuel                 15919 non-null  object
 23  cons_comb            13886 non-null  float64
 24  cons_city            13483 non-null  float64
 25  cons_country         13543 non-null  float64
 26  co2_emission         13483 non-null  float64
 27  emission_class       12291 non-null  object
 28  comfort_convenience  14999 non-null  object
 29  entertainment_media  14545 non-null  object
 30  extras               12957 non-null  object
 31  safety_security      14937 non-null  object
 32  gears                11207 non-null  float64
dtypes: float64(15), int64(1), object(17)
memory usage: 4.0+ MB

In [5]:
missing_percent=(df.isnull().sum()*100 / len(df)).sort_values(ascending=False)
missing_percent

inspection_new        75.30
warranty              69.51
weight_kg             43.81
drive_chain           43.08
previous_owners       41.71
paint_type            36.26
cylinders             35.68
upholstery_color      31.90
upholstery_type       30.60
gears                 29.60
vat                   28.35
emission_class        22.79
extras                18.61
co2_emission          15.30
cons_city             15.30
cons_country          14.93
cons_comb             12.77
age                   10.03
entertainment_media    8.63
km                     6.43
safety_security        6.17
nr_of_seats            6.14
comfort_convenience    5.78
body_color             3.75
displacement_cc        3.12
nr_of_doors            1.33
hp_kw                  0.55
body_type              0.38
type                   0.01
fuel                   0.00
gearing_type           0.00
price                  0.00
make_model             0.00
dtype: float64

In [6]:
missing_total=(df.isnull().sum()).sort_values(ascending=False)
missing_total

inspection_new         11987
warranty               11066
weight_kg               6974
drive_chain             6858
previous_owners         6640
paint_type              5772
cylinders               5680
upholstery_color        5078
upholstery_type         4871
gears                   4712
vat                     4513
emission_class          3628
extras                  2962
co2_emission            2436
cons_city               2436
cons_country            2376
cons_comb               2033
age                     1597
entertainment_media     1374
km                      1024
safety_security          982
nr_of_seats              977
comfort_convenience      920
body_color               597
displacement_cc          496
nr_of_doors              212
hp_kw                     88
body_type                 60
type                       2
fuel                       0
gearing_type               0
price                      0
make_model                 0
dtype: int64

## Examining the Features and Filling Missing Values

In [7]:
# Creating a function to examine the features.

def look_before(col):
    print("column name    : ", col)
    print("--------------------------------")
    print("per_of_nulls   : ", "%", round(df[col].isnull().sum()/df.shape[0]*100, 2))
    print("num_of_nulls   : ", df[col].isnull().sum())
    print("num_of_uniques : ", df[col].nunique())
    print("--------------------------------")
    print(df[col].value_counts(dropna = False))

### make_model

In [8]:
look_before("make_model")

column name    :  make_model
--------------------------------
per_of_nulls   :  % 0.0
num_of_nulls   :  0
num_of_uniques :  9
--------------------------------
Audi A3           3097
Audi A1           2614
Opel Insignia     2598
Opel Astra        2526
Opel Corsa        2219
Renault Clio      1839
Renault Espace     991
Renault Duster      34
Audi A2              1
Name: make_model, dtype: int64

### body_type

In [9]:
look_before("body_type")

column name    :  body_type
--------------------------------
per_of_nulls   :  % 0.38
num_of_nulls   :  60
num_of_uniques :  9
--------------------------------
Sedans           7903
Station wagon    3553
Compact          3153
Van               783
Other             290
Transporter        88
NaN                60
Off-Road           56
Coupe              25
Convertible         8
Name: body_type, dtype: int64

In [10]:
df.groupby('make_model')['body_type'].value_counts(dropna=False)

make_model      body_type
Audi A1         Sedans           1538
                Compact          1039
                Station wagon      21
                Other              13
                Coupe               2
                Van                 1
Audi A2         Off-Road            1
Audi A3         Sedans           2598
                Station wagon     282
                Compact           182
                Other              16
                Convertible         8
                NaN                 7
                Coupe               4
Opel Astra      Station wagon    1211
                Sedans           1053
                Compact           185
                Other              67
                NaN                 7
                Coupe               2
                Off-Road            1
Opel Corsa      Compact          1230
                Sedans            875
                Other              87
                Coupe              13
                Transporter         7
                Off-Road            3
                NaN                 2
                Van                 2
Opel Insignia   Station wagon    1611
                Sedans            900
                Other              48
                Compact            27
                Off-Road            7
                NaN                 3
                Coupe               1
                Van                 1
Renault Clio    Sedans            918
                Compact           484
                Station wagon     337
                Other              51
                Transporter        29
                NaN                15
                Off-Road            2
                Van                 2
                Coupe               1
Renault Duster  Off-Road           34
Renault Espace  Van               777
                Station wagon      91
                Transporter        52
                NaN                26
                Sedans             21
                Off-Road            8
                Other               8
                Compact             6
                Coupe               2
Name: body_type, dtype: int64

In [11]:
# Filling the column according to the "make_model" column.

df["body_type"].fillna(df.groupby('make_model')['body_type'].transform(lambda x: x.mode()[0]), inplace=True)

In [12]:
df.body_type.isnull().sum()

0

### price (target feature)

In [13]:
look_before("price")

column name    :  price
--------------------------------
per_of_nulls   :  % 0.0
num_of_nulls   :  0
num_of_uniques :  2956
--------------------------------
14990    154
15990    151
10990    139
15900    106
17990    102
        ...
17559      1
17560      1
17570      1
17575      1
39875      1
Name: price, Length: 2956, dtype: int64

### vat

In [14]:
look_before("vat")

column name    :  vat
--------------------------------
per_of_nulls   :  % 28.35
num_of_nulls   :  4513
num_of_uniques :  2
--------------------------------
VAT deductible      10980
NaN                  4513
Price negotiable      426
Name: vat, dtype: int64

In [15]:
df["vat"] = df["vat"].fillna("VAT non-deductible")

In [16]:
df.vat.isnull().sum()

0

### type

In [17]:
look_before("type")

column name    :  type
--------------------------------
per_of_nulls   :  % 0.01
num_of_nulls   :  2
num_of_uniques :  5
--------------------------------
Used              11096
New                1650
Pre-registered     1364
Employee's car     1011
Demonstration       796
NaN                   2
Name: type, dtype: int64

In [18]:
df.type.mode()

0    Used
dtype: object

In [19]:
df["type"]=df.type.fillna(df.type.mode()[0])

In [20]:
df.type.isnull().sum()

0

### age

In [21]:
look_before("age")

column name    :  age
--------------------------------
per_of_nulls   :  % 10.03
num_of_nulls   :  1597
num_of_uniques :  4
--------------------------------
1.00    4522
3.00    3674
2.00    3273
0.00    2853
NaN     1597
Name: age, dtype: int64

In [22]:
df.type.mode()

0    Used
dtype: object

In [23]:
df.groupby("type").age.describe()

                  count  mean  std  min  25%  50%  75%  max
type
Demonstration    791.00  0.24 0.52 0.00 0.00 0.00 0.00 3.00
Employee's car  1008.00  1.01 0.54 0.00 1.00 1.00 1.00 3.00
New              103.00  0.03 0.17 0.00 0.00 0.00 0.00 1.00
Pre-registered  1358.00  0.13 0.37 0.00 0.00 0.00 0.00 3.00
Used           11062.00  1.87 0.96 0.00 1.00 2.00 3.00 3.00

In [24]:
#type göre gruplayıp age'ın medianı ile doldura
df["age"]=df.groupby("type").age.apply(lambda x: x.fillna(x.median()))

In [25]:
df["age"].isnull().sum()

0

In [26]:
df.age.describe()

count   15919.00
mean        1.39
std         1.12
min         0.00
25%         0.00
50%         1.00
75%         2.00
max         3.00
Name: age, dtype: float64

### km

In [27]:
look_before("km")

column name    :  km
--------------------------------
per_of_nulls   :  % 6.43
num_of_nulls   :  1024
num_of_uniques :  6689
--------------------------------
10.00       1045
NaN         1024
1.00         367
5.00         170
50.00        148
            ...
67469.00       1
43197.00       1
10027.00       1
35882.00       1
57.00          1
Name: km, Length: 6690, dtype: int64

In [28]:
df.km.describe()

count    14895.00
mean     34130.13
std      37352.98
min          0.00
25%       5153.00
50%      22740.00
75%      49371.50
max     317000.00
Name: km, dtype: float64

In [29]:
df.groupby(["type","age"]).km.describe()

                      count     mean      std      min      25%      50%  \
type           age
Demonstration  0.00  604.00  3373.87  3540.54     3.00   450.00  2900.00
               1.00  130.00  8294.20  7998.99     8.00  1601.00  5192.50
               2.00   27.00 25327.30 17914.69    20.00 15470.50 18900.00
               3.00    2.00 45500.00 14849.24 35000.00 40250.00 45500.00
Employee's car 0.00  121.00  4473.93  5473.43     1.00   150.00  3811.00
               1.00  766.00 19295.28  9381.31     1.00 11267.75 21000.00
               2.00   99.00 37926.51 21932.49    59.00 22138.00 37750.00
               3.00   17.00 59123.65 28115.75  7790.00 40700.00 58962.00
New            0.00  799.00    16.99    95.03     0.00     5.00    10.00
               1.00    2.00    53.50    65.76     7.00    30.25    53.50
Pre-registered 0.00 1102.00   100.65   649.07     1.00     7.00    10.00
               1.00  134.00   435.51  1902.27     1.00    10.00    12.00
               2.00    9.00  1854.00  4129.20     1.00     1.00    99.00
               3.00    1.00    10.00      NaN    10.00    10.00    10.00
Used           0.00  803.00  3712.17  8499.41     1.00    35.50  1233.00
               1.00 3454.00 18807.50 10952.38     1.00 10800.00 18000.00
               2.00 3171.00 41887.94 28563.95     5.00 21533.50 34732.00
               3.00 3654.00 77566.42 39184.19    35.00 48103.75 73000.00

                         75%       max
type           age
Demonstration  0.00  5000.00  20000.00
               1.00 13737.50  38400.00
               2.00 28238.00  78000.00
               3.00 50750.00  56000.00
Employee's car 0.00  6300.00  37500.00
               1.00 26957.50  80009.00
               2.00 46500.00 112789.00
               3.00 84386.00 103000.00
New            0.00    10.00   2500.00
               1.00    76.75    100.00
Pre-registered 0.00    20.00   9998.00
               1.00    80.00  15378.00
               2.00   153.00  12300.00
               3.00    10.00     10.00
Used           0.00  5000.00 127022.00
               1.00 25096.25 136000.00
               2.00 55000.00 317000.00
               3.00 99987.50 291800.00

In [30]:
df["km"]=  df.groupby(["type","age"]).km.apply(lambda x: x.fillna(x.mean()))

In [31]:
df.km.describe()

count    15919.00
mean     31967.47
std      37069.15
min          0.00
25%       2000.00
50%      20413.00
75%      46898.50
max     317000.00
Name: km, dtype: float64

In [32]:
df.km.isnull().sum()

0

## previous_owners

In [33]:
look_before("previous_owners")

column name    :  previous_owners
--------------------------------
per_of_nulls   :  % 41.71
num_of_nulls   :  6640
num_of_uniques :  5
--------------------------------
1.00    8294
NaN     6640
2.00     778
0.00     188
3.00      17
4.00       2
Name: previous_owners, dtype: int64

In [34]:
df.groupby("type").previous_owners.describe()

                 count  mean  std  min  25%  50%  75%  max
type
Demonstration   514.00  1.01 0.11 1.00 1.00 1.00 1.00 2.00
Employee's car  655.00  1.01 0.15 0.00 1.00 1.00 1.00 2.00
New             179.00  0.08 0.28 0.00 0.00 0.00 0.00 1.00
Pre-registered  845.00  1.01 0.08 1.00 1.00 1.00 1.00 2.00
Used           7086.00  1.11 0.33 0.00 1.00 1.00 1.00 4.00

In [35]:
df.groupby("type").previous_owners.apply(lambda x : x.mode()[0])

type
Demonstration    1.00
Employee's car   1.00
New              0.00
Pre-registered   1.00
Used             1.00
Name: previous_owners, dtype: float64

In [36]:
df.groupby("age").previous_owners.apply(lambda x : x.mode()[0])

age
0.00   1.00
1.00   1.00
2.00   1.00
3.00   1.00
Name: previous_owners, dtype: float64

In [37]:
df.groupby("type").previous_owners.apply(lambda x : x.mode()[0])

type
Demonstration    1.00
Employee's car   1.00
New              0.00
Pre-registered   1.00
Used             1.00
Name: previous_owners, dtype: float64

In [38]:
df.groupby("type").previous_owners.apply(lambda x: x.isnull().sum())

type
Demonstration      282
Employee's car     356
New               1471
Pre-registered     519
Used              4012
Name: previous_owners, dtype: int64

In [39]:
df.groupby(["type", "age"]).previous_owners.apply(lambda x: x.isnull().sum())

type            age
Demonstration   0.00     242
                1.00      34
                2.00       5
                3.00       1
Employee's car  0.00      54
                1.00     223
                2.00      71
                3.00       8
New             0.00    1469
                1.00       2
Pre-registered  0.00     454
                1.00      62
                2.00       3
                3.00       0
Used            0.00     433
                1.00    1153
                2.00    1205
                3.00    1221
Name: previous_owners, dtype: int64

In [40]:
df.groupby("previous_owners").price.describe()

,count,mean,std,min,25%,50%,75%,max
previous_owners,,,,,,,,
0.00,188.00,20773.60,7661.82,6299.00,14993.00,21725.00,24492.50,52120.00
1.00,8294.00,17215.68,6575.14,5250.00,12680.00,16275.00,20840.00,74600.00
2.00,778.00,14953.49,5208.81,6400.00,10950.00,14990.00,17537.50,35990.00
3.00,17.00,14676.24,5901.81,7500.00,10598.00,13100.00,17900.00,27000.00
4.00,2.00,20150.00,1626.35,19000.00,19575.00,20150.00,20725.00,21300.00

In [41]:
df["previous_owners"] = df.groupby("type").previous_owners.apply(lambda x : x.fillna(x.mode()[0]))
df["previous_owners"]

0       2.00
1       1.00
2       1.00
3       1.00
4       1.00
        ...
15914   0.00
15915   1.00
15916   1.00
15917   1.00
15918   1.00
Name: previous_owners, Length: 15919, dtype: float64

In [42]:
df["previous_owners"].isnull().sum()

0

### inspection_new

In [43]:
look_before("inspection_new")

column name    :  inspection_new
--------------------------------
per_of_nulls   :  % 75.3
num_of_nulls   :  11987
num_of_uniques :  1
--------------------------------
NaN    11987
Yes     3932
Name: inspection_new, dtype: int64

In [44]:
df["inspection_new"].fillna("-", inplace=True)

In [45]:
df["inspection_new"].value_counts(dropna=False)

-      11987
Yes     3932
Name: inspection_new, dtype: int64

In [46]:
df.groupby(["make_model", "body_type", "age", "inspection_new"]).price.describe()

                                              count     mean     std      min  \
make_model     body_type age  inspection_new
Audi A1        Compact   0.00 -              243.00 24206.37 3530.09 16220.00
                              Yes            134.00 22505.37 3094.13 14900.00
                         1.00 -              150.00 19065.31 2836.07 14500.00
                              Yes            117.00 18002.93 2303.34 13980.00
                         2.00 -              115.00 16425.67 1985.79 10999.00
...                                             ...      ...     ...      ...
Renault Espace Van       1.00 Yes             33.00 33000.88 3414.04 29385.00
                         2.00 -              147.00 26893.53 3626.25 14600.00
                              Yes              3.00 32059.67 8523.29 26990.00
                         3.00 -              173.00 22125.37 3161.76 12990.00
                              Yes             30.00 21790.10 3690.17 12614.00

                                                  25%      50%      75%  \
make_model     body_type age  inspection_new
Audi A1        Compact   0.00 -              21435.00 23480.00 27390.00
                              Yes            20388.00 22400.00 22942.25
                         1.00 -              16490.00 18800.00 21949.75
                              Yes            16445.00 16900.00 19988.00
                         2.00 -              15450.00 15850.00 16890.00
...                                               ...      ...      ...
Renault Espace Van       1.00 Yes            29990.00 31899.00 35300.00
                         2.00 -              24990.00 25500.00 28982.50
                              Yes            27139.50 27289.00 34594.50
                         3.00 -              19900.00 22222.00 24500.00
                              Yes            19085.00 21982.50 24825.00

                                                  max
make_model     body_type age  inspection_new
Audi A1        Compact   0.00 -              31990.00
                              Yes            29197.00
                         1.00 -              23777.00
                              Yes            23829.00
                         2.00 -              22150.00
...                                               ...
Renault Espace Van       1.00 Yes            38990.00
                         2.00 -              35930.00
                              Yes            41900.00
                         3.00 -              27900.00
                              Yes            26970.00

[239 rows x 8 columns]

In [47]:
df["inspection_new"].replace("-", "No", inplace=True)

In [48]:
df["inspection_new"].value_counts(dropna=False)

No     11987
Yes     3932
Name: inspection_new, dtype: int64

In [49]:
df["inspection_new"].replace(["Yes", "No"], [1,0], inplace = True)

In [50]:
df["inspection_new"].value_counts(dropna=False)

0    11987
1     3932
Name: inspection_new, dtype: int64

In [51]:
df.inspection_new.isnull().sum()

0

### upholstery_type

In [52]:
look_before("upholstery_type")

column name    :  upholstery_type
--------------------------------
per_of_nulls   :  % 30.6
num_of_nulls   :  4871
num_of_uniques :  5
--------------------------------
Cloth           8423
NaN             4871
Part leather    1499
Full leather    1009
Velour            60
alcantara         57
Name: upholstery_type, dtype: int64

In [53]:
df["upholstery_type"].replace(["Velour", "alcantara", "Part leather", "Full leather"], ["Cloth", "Part/Full Leather", "Part/Full Leather", "Part/Full Leather"], inplace=True)

In [54]:
df["upholstery_type"].value_counts(dropna=False)

Cloth                8483
NaN                  4871
Part/Full Leather    2565
Name: upholstery_type, dtype: int64

In [55]:
def fill(df, group_col1, group_col2, col_name, method): # method can be "mode" or "median" or "ffill"
    if method == "mode":
        for group1 in list(df[group_col1].unique()):
            for group2 in list(df[group_col2].unique()):
                cond1 = df[group_col1]==group1
                cond2 = (df[group_col1]==group1) & (df[group_col2]==group2)
                mode1 = list(df[cond1][col_name].mode())
                mode2 = list(df[cond2][col_name].mode())
                if mode2 != []:
                    df.loc[cond2, col_name] = df.loc[cond2, col_name].fillna(df[cond2][col_name].mode()[0])
                elif mode1 != []:
                    df.loc[cond2, col_name] = df.loc[cond2, col_name].fillna(df[cond1][col_name].mode()[0])
                else:
                    df.loc[cond2, col_name] = df.loc[cond2, col_name].fillna(df[col_name].mode()[0])
                
    elif method == "median":
        for group1 in list(df[group_col1].unique()):
            for group2 in list(df[group_col2].unique()):
                cond1 = df[group_col1]==group1
                cond2 = (df[group_col1]==group1) & (df[group_col2]==group2)
                df.loc[cond2, col_name] = df.loc[cond2, col_name].fillna(df[cond2][col_name].median()).fillna(df[cond1][col_name].median()).fillna(df[col_name].median())
                
    elif method == "ffill":           
        for group1 in list(df[group_col1].unique()):
            for group2 in list(df[group_col2].unique()):
                cond2 = (df[group_col1]==group1) & (df[group_col2]==group2)
                df.loc[cond2, col_name] = df.loc[cond2, col_name].fillna(method="ffill").fillna(method="bfill")
                
        for group1 in list(df[group_col1].unique()):
            cond1 = df[group_col1]==group1
            df.loc[cond1, col_name] = df.loc[cond1, col_name].fillna(method="ffill").fillna(method="bfill")            
           
        df[col_name] = df[col_name].fillna(method="ffill").fillna(method="bfill")
    
    print("Number of NaN : ",df[col_name].isnull().sum())
    print("------------------")
    print(df[col_name].value_counts(dropna=False))

In [56]:
fill(df, "make_model", "body_type", "upholstery_type", "ffill")

Number of NaN :  0
------------------
Cloth                12261
Part/Full Leather     3658
Name: upholstery_type, dtype: int64

### upholstery_color

In [57]:
look_before("upholstery_color")

column name    :  upholstery_color
--------------------------------
per_of_nulls   :  % 31.9
num_of_nulls   :  5078
num_of_uniques :  10
--------------------------------
Black     8201
NaN       5078
Grey      1376
Other      960
Brown      207
Beige       54
Blue        16
White       13
Red          9
Yellow       4
Orange       1
Name: upholstery_color, dtype: int64

In [58]:
df.drop("upholstery_color", axis=1, inplace=True)

### body_color

In [59]:
look_before("body_color")

column name    :  body_color
--------------------------------
per_of_nulls   :  % 3.75
num_of_nulls   :  597
num_of_uniques :  14
--------------------------------
Black     3745
Grey      3505
White     3406
Silver    1647
Blue      1431
Red        957
NaN        597
Brown      289
Green      154
Beige      108
Yellow      51
Violet      18
Bronze       6
Orange       3
Gold         2
Name: body_color, dtype: int64

In [60]:
df.groupby(["make_model", "body_type", 'body_color']).price.describe()

                                     count     mean     std      min      25%  \
make_model     body_type body_color
Audi A1        Compact   Beige        6.00 20556.50 2475.51 16240.00 19766.75
                         Black      320.00 18196.28 4206.97  9950.00 14990.00
                         Blue        96.00 19145.41 4541.86 11444.00 15870.00
                         Brown        9.00 16982.00 2964.39 11445.00 15993.00
                         Green       17.00 23558.12 3849.70 19388.00 19388.00
...                                    ...      ...     ...      ...      ...
Renault Espace Van       Brown       27.00 25718.26 9649.96 12614.00 19225.00
                         Grey       299.00 30307.20 8619.53 15500.00 24875.00
                         Silver      36.00 27373.00 4809.68 12990.00 24560.00
                         Violet      11.00 24434.27 4603.89 19900.00 20499.50
                         White      173.00 32830.31 7611.78 12990.00 28975.00

                                         50%      75%      max
make_model     body_type body_color
Audi A1        Compact   Beige      21420.00 21700.00 23250.00
                         Black      16890.00 21390.00 28997.00
                         Blue       16925.00 22226.00 28980.00
                         Brown      16820.00 18850.00 20750.00
                         Green      22490.00 28240.00 28400.00
...                                      ...      ...      ...
Renault Espace Van       Brown      22990.00 27187.50 47990.00
                         Grey       28140.00 34649.00 64332.00
                         Silver     28500.00 29900.00 35100.00
                         Violet     23900.00 26299.00 34990.00
                         White      31975.00 35975.00 64298.00

[261 rows x 8 columns]

In [61]:
fill(df, "make_model", "body_type", "body_color", "mode")

Number of NaN :  0
------------------
Black     3941
Grey      3839
White     3469
Silver    1647
Blue      1431
Red        957
Brown      289
Green      158
Beige      108
Yellow      51
Violet      18
Bronze       6
Orange       3
Gold         2
Name: body_color, dtype: int64

### paint_type

In [62]:
look_before("paint_type")

column name    :  paint_type
--------------------------------
per_of_nulls   :  % 36.26
num_of_nulls   :  5772
num_of_uniques :  3
--------------------------------
Metallic       9794
NaN            5772
Uni/basic       347
Perl effect       6
Name: paint_type, dtype: int64

In [63]:
df.groupby(["make_model", "body_type", "age", 'paint_type']).price.describe()

                                          count     mean     std      min  \
make_model     body_type age  paint_type
Audi A1        Compact   0.00 Metallic   229.00 24622.26 3172.06 17880.00
                              Uni/basic    2.00 19888.00    0.00 19888.00
                         1.00 Metallic   212.00 18861.65 2674.02 13980.00
                         2.00 Metallic   108.00 17001.35 2294.78 10999.00
                              Uni/basic    1.00 17900.00     NaN 17900.00
...                                         ...      ...     ...      ...
Renault Espace Van       1.00 Uni/basic    6.00 29056.67 3244.17 24750.00
                         2.00 Metallic    91.00 27069.63 3698.38 16950.00
                              Uni/basic    2.00 26700.00 3535.53 24200.00
                         3.00 Metallic   134.00 22325.57 3269.42 12614.00
                              Uni/basic    3.00 22628.33 2094.72 20995.00

                                              25%      50%      75%      max
make_model     body_type age  paint_type
Audi A1        Compact   0.00 Metallic   21990.00 23700.00 27780.00 31990.00
                              Uni/basic  19888.00 19888.00 19888.00 19888.00
                         1.00 Metallic   16448.75 17515.00 21482.50 23829.00
                         2.00 Metallic   15450.00 15954.50 18957.50 22150.00
                              Uni/basic  17900.00 17900.00 17900.00 17900.00
...                                           ...      ...      ...      ...
Renault Espace Van       1.00 Uni/basic  26900.00 29400.00 31900.00 31990.00
                         2.00 Metallic   25490.00 25490.00 28700.00 41900.00
                              Uni/basic  25450.00 26700.00 27950.00 29200.00
                         3.00 Metallic   19900.00 21990.00 24900.00 27900.00
                              Uni/basic  21447.50 21900.00 23445.00 24990.00

[190 rows x 8 columns]

In [64]:
fill(df, "make_model", "body_type", "paint_type", "mode")

Number of NaN :  0
------------------
Metallic       15523
Uni/basic        390
Perl effect        6
Name: paint_type, dtype: int64

### nr_of_doors

In [65]:
look_before("nr_of_doors")

column name    :  nr_of_doors
--------------------------------
per_of_nulls   :  % 1.33
num_of_nulls   :  212
num_of_uniques :  6
--------------------------------
5.00    11575
4.00     3079
3.00      832
2.00      219
NaN       212
1.00        1
7.00        1
Name: nr_of_doors, dtype: int64

In [66]:
fill(df, "make_model", "body_type", "nr_of_doors", "mode")

Number of NaN :  0
------------------
5.00    11787
4.00     3079
3.00      832
2.00      219
1.00        1
7.00        1
Name: nr_of_doors, dtype: int64

### nr_of_seats

In [67]:
look_before("nr_of_seats")

column name    :  nr_of_seats
--------------------------------
per_of_nulls   :  % 6.14
num_of_nulls   :  977
num_of_uniques :  6
--------------------------------
5.00    13336
4.00     1125
NaN       977
7.00      362
2.00      116
6.00        2
3.00        1
Name: nr_of_seats, dtype: int64

In [68]:
fill(df, "make_model", "body_type", "nr_of_seats", "mode")

Number of NaN :  0
------------------
5.00    14308
4.00     1127
7.00      362
2.00      119
6.00        2
3.00        1
Name: nr_of_seats, dtype: int64

### cylinders

In [69]:
look_before("cylinders")

column name    :  cylinders
--------------------------------
per_of_nulls   :  % 35.68
num_of_nulls   :  5680
num_of_uniques :  7
--------------------------------
4.00    8105
NaN     5680
3.00    2104
5.00      22
6.00       3
8.00       2
2.00       2
1.00       1
Name: cylinders, dtype: int64

In [70]:
fill(df, "make_model", "body_type", "cylinders", "mode")

Number of NaN :  0
------------------
4.00    12926
3.00     2963
5.00       22
6.00        3
8.00        2
2.00        2
1.00        1
Name: cylinders, dtype: int64

In [71]:
df.drop("cylinders", axis = 1, inplace = True)

### drive_chain

In [72]:
look_before("drive_chain")

column name    :  drive_chain
--------------------------------
per_of_nulls   :  % 43.08
num_of_nulls   :  6858
num_of_uniques :  3
--------------------------------
front    8886
NaN      6858
4WD       171
rear        4
Name: drive_chain, dtype: int64

In [73]:
fill(df, "make_model", "body_type", "drive_chain", "mode")

Number of NaN :  0
------------------
front    15711
4WD        204
rear         4
Name: drive_chain, dtype: int64

### emission_class

In [74]:
look_before("emission_class")

column name    :  emission_class
--------------------------------
per_of_nulls   :  % 22.79
num_of_nulls   :  3628
num_of_uniques :  3
--------------------------------
Euro 6    12173
NaN        3628
Euro 5       78
Euro 4       40
Name: emission_class, dtype: int64

In [75]:
fill(df, "age", "fuel", "emission_class", "ffill")

Number of NaN :  0
------------------
Euro 6    15770
Euro 5       99
Euro 4       50
Name: emission_class, dtype: int64

In [76]:
df.drop("emission_class", axis=1, inplace=True)

### gears

In [77]:
look_before("gears")

column name    :  gears
--------------------------------
per_of_nulls   :  % 29.6
num_of_nulls   :  4712
num_of_uniques :  10
--------------------------------
6.00     5822
NaN      4712
5.00     3239
7.00     1908
8.00      224
9.00        6
1.00        2
3.00        2
4.00        2
2.00        1
50.00       1
Name: gears, dtype: int64

In [78]:
df.groupby(["make_model", "body_type", "gearing_type", "gears"]).price.describe()

                                               count     mean      std  \
make_model     body_type gearing_type   gears
Audi A1        Compact   Automatic      5.00    3.00 22184.33  3421.30
                                        6.00    6.00 21038.33  4282.04
                                        7.00  199.00 22059.25  3918.12
                                        8.00    1.00 16880.00      NaN
                         Manual         5.00  277.00 16329.47  3040.93
...                                              ...      ...      ...
Renault Espace Van       Automatic      9.00    6.00 52208.50  2735.33
                         Manual         6.00   50.00 22798.56  6056.78
                                        7.00    1.00 36590.00      NaN
                         Semi-automatic 6.00   11.00 28885.45 11439.11
                                        7.00    1.00 19900.00      NaN

                                                   min      25%      50%  \
make_model     body_type gearing_type   gears
Audi A1        Compact   Automatic      5.00  18497.00 20648.50 22800.00
                                        6.00  16430.00 18725.00 20920.00
                                        7.00  13990.00 18970.00 21790.00
                                        8.00  16880.00 16880.00 16880.00
                         Manual         5.00   9950.00 13990.00 15900.00
...                                                ...      ...      ...
Renault Espace Van       Automatic      9.00  48765.00 50002.75 52711.00
                         Manual         6.00  12614.00 18847.50 21937.50
                                        7.00  36590.00 36590.00 36590.00
                         Semi-automatic 6.00  16900.00 21450.00 24900.00
                                        7.00  19900.00 19900.00 19900.00

                                                   75%      max
make_model     body_type gearing_type   gears
Audi A1        Compact   Automatic      5.00  24028.00 25256.00
                                        6.00  21060.00 28860.00
                                        7.00  24365.00 29181.00
                                        8.00  16880.00 16880.00
                         Manual         5.00  16940.00 22990.00
...                                                ...      ...
Renault Espace Van       Automatic      9.00  54414.25 54982.00
                         Manual         6.00  25799.75 47990.00
                                        7.00  36590.00 36590.00
                         Semi-automatic 6.00  32750.00 56950.00
                                        7.00  19900.00 19900.00

[173 rows x 8 columns]

In [79]:
for group1 in list(df["make_model"].unique()):
    for group2 in list(df["body_type"].unique()):
        for group3 in list(df["gearing_type"].unique()):
            cond1 = df["make_model"]==group1
            cond2 = (df["make_model"]==group1) & (df["body_type"]==group2)
            cond3 = (df["make_model"]==group1) & (df["body_type"]==group2) & (df["gearing_type"]==group3)
            mode1 = list(df[cond1]["gears"].mode())
            mode2 = list(df[cond2]["gears"].mode())
            mode3 = list(df[cond3]["gears"].mode())
            if mode3 != []:
                df.loc[cond3, "gears"] = df.loc[cond3, "gears"].fillna(df[cond3]["gears"].mode()[0])
            elif mode2 != []:
                df.loc[cond3, "gears"] = df.loc[cond3, "gears"].fillna(df[cond2]["gears"].mode()[0])
            elif mode1 != []:
                df.loc[cond3, "gears"] = df.loc[cond3, "gears"].fillna(df[cond1]["gears"].mode()[0])
            else:
                df.loc[cond3, "gears"] = df.loc[cond3, "gears"].fillna(df["gears"].mode()[0])

In [80]:
df["gears"].value_counts(dropna=False)

6.00     8615
5.00     4255
7.00     2810
8.00      225
9.00        6
1.00        2
3.00        2
4.00        2
2.00        1
50.00       1
Name: gears, dtype: int64

In [81]:
df["gears"].isnull().sum()

0

### hp_kw

In [82]:
look_before("hp_kw")

column name    :  hp_kw
--------------------------------
per_of_nulls   :  % 0.55
num_of_nulls   :  88
num_of_uniques :  80
--------------------------------
85.00     2542
66.00     2122
81.00     1402
100.00    1308
110.00    1112
70.00      888
125.00     707
51.00      695
55.00      569
118.00     516
92.00      466
121.00     392
147.00     380
77.00      345
56.00      286
54.00      276
103.00     253
87.00      232
165.00     194
88.00      177
60.00      160
162.00      98
NaN         88
74.00       81
96.00       72
71.00       59
101.00      47
67.00       40
154.00      39
122.00      35
119.00      30
164.00      27
135.00      24
82.00       22
52.00       22
78.00       20
1.00        20
294.00      18
146.00      18
141.00      16
57.00       10
104.00       8
120.00       8
191.00       7
112.00       7
155.00       6
117.00       6
184.00       5
90.00        4
76.00        4
65.00        4
149.00       3
80.00        3
168.00       3
98.00        3
93.00        3
228.00       2
270.00       2
53.00        2
140.00       2
86.00        2
167.00       2
127.00       2
89.00        2
143.00       2
63.00        2
40.00        2
150.00       2
163.00       1
115.00       1
132.00       1
75.00        1
4.00         1
137.00       1
123.00       1
133.00       1
84.00        1
195.00       1
44.00        1
239.00       1
9.00         1
Name: hp_kw, dtype: int64

In [83]:
df.groupby(["make_model", "body_type","hp_kw"]).price.describe()

                                 count     mean     std      min      25%  \
make_model     body_type hp_kw
Audi A1        Compact   60.00   58.00 15189.83 1663.61 10900.00 14390.00
                         66.00  162.00 15398.21 1934.30 10490.00 14042.50
                         70.00  332.00 17983.26 3315.81  9950.00 15480.00
                         71.00   32.00 20831.59 2410.84 15890.00 18937.50
                         85.00  330.00 22604.10 4572.57 11100.00 19700.00
...                                ...      ...     ...      ...      ...
Renault Espace Van       149.00   1.00 27990.00     NaN 27990.00 27990.00
                         150.00   1.00 43545.00     NaN 43545.00 43545.00
                         165.00 174.00 38180.24 7926.98 26800.00 31990.00
                         167.00   2.00 37990.00 2828.43 35990.00 36990.00
                         168.00   3.00 38410.00 1712.66 36590.00 37620.00

                                     50%      75%      max
make_model     body_type hp_kw
Audi A1        Compact   60.00  15774.50 16345.00 16978.00
                         66.00  15465.00 16445.00 23700.00
                         70.00  17447.00 21190.00 28990.00
                         71.00  21425.00 22462.25 25256.00
                         85.00  22497.00 26980.00 31990.00
...                                  ...      ...      ...
Renault Espace Van       149.00 27990.00 27990.00 27990.00
                         150.00 43545.00 43545.00 43545.00
                         165.00 35934.50 40991.75 64332.00
                         167.00 37990.00 38990.00 39990.00
                         168.00 38650.00 39320.00 39990.00

[332 rows x 8 columns]

In [84]:
fill(df, "make_model", "body_type", "hp_kw", "mode")

Number of NaN :  0
------------------
85.00     2543
66.00     2124
81.00     1403
100.00    1315
110.00    1113
70.00      890
125.00     710
51.00      696
55.00      589
118.00     550
92.00      466
121.00     392
147.00     380
77.00      353
56.00      294
54.00      276
103.00     253
87.00      232
165.00     194
88.00      177
60.00      160
162.00      98
74.00       81
96.00       72
71.00       59
101.00      47
67.00       40
154.00      39
122.00      35
119.00      30
164.00      27
135.00      24
52.00       22
82.00       22
1.00        20
78.00       20
294.00      18
146.00      18
141.00      16
57.00       10
120.00       8
104.00       8
112.00       7
191.00       7
155.00       6
117.00       6
184.00       5
65.00        4
90.00        4
76.00        4
168.00       3
98.00        3
149.00       3
80.00        3
93.00        3
167.00       2
228.00       2
53.00        2
143.00       2
150.00       2
140.00       2
270.00       2
63.00        2
40.00        2
127.00       2
86.00        2
89.00        2
163.00       1
132.00       1
115.00       1
239.00       1
4.00         1
137.00       1
133.00       1
84.00        1
123.00       1
44.00        1
195.00       1
75.00        1
9.00         1
Name: hp_kw, dtype: int64

### displacement_cc

In [85]:
look_before("displacement_cc")

column name    :  displacement_cc
--------------------------------
per_of_nulls   :  % 3.12
num_of_nulls   :  496
num_of_uniques :  77
--------------------------------
1598.00     4761
999.00      2438
1398.00     1314
1399.00      749
1229.00      677
1956.00      670
1461.00      595
1490.00      559
NaN          496
1422.00      467
1197.00      353
898.00       351
1395.00      320
1968.00      301
1149.00      288
1618.00      212
1798.00      210
1498.00      196
1600.00      130
1248.00      110
1997.00      103
1364.00      102
1400.00       90
998.00        72
1500.00       50
2000.00       46
1000.00       40
1.00          36
1998.00       25
2480.00       20
1200.00       18
1984.00       18
1397.00       11
899.00        11
160.00         6
929.00         5
1499.00        5
997.00         4
1596.00        4
139.00         4
900.00         4
1599.00        3
1199.00        3
1396.00        3
1495.00        2
1589.00        2
1300.00        2
2.00           2
995.00         2
1496.00        1
890.00         1
1580.00        1
1995.00        1
1333.00        1
54.00          1
1533.00        1
1100.00        1
1350.00        1
16000.00       1
1856.00        1
1568.00        1
1896.00        1
1584.00        1
996.00         1
1696.00        1
1686.00        1
15898.00       1
1368.00        1
140.00         1
973.00         1
1239.00        1
1369.00        1
1390.00        1
122.00         1
1198.00        1
1195.00        1
2967.00        1
1800.00        1
Name: displacement_cc, dtype: int64

In [86]:
df.groupby(["make_model", "body_type","displacement_cc"]).price.describe()

                                          count     mean     std      min  \
make_model     body_type displacement_cc
Audi A1        Compact   929.00            5.00 16364.00 1504.82 14980.00
                         995.00            2.00 21990.00 1414.21 20990.00
                         999.00          663.00 20294.10 4570.80  9950.00
                         1000.00           7.00 19498.43 5396.20 13500.00
                         1395.00          98.00 18246.62 3084.08 12550.00
...                                         ...      ...     ...      ...
Renault Espace Van       1600.00          11.00 28226.27 6180.98 18999.00
                         1618.00          53.00 26831.98 6164.23 18480.00
                         1798.00         173.00 38147.24 7888.54 26800.00
                         1800.00           1.00 50750.00     NaN 50750.00
                         1997.00          92.00 39621.42 7514.27 12990.00

                                              25%      50%      75%      max
make_model     body_type displacement_cc
Audi A1        Compact   929.00          15480.00 16240.00 16240.00 18880.00
                         995.00          21490.00 21990.00 22490.00 22990.00
                         999.00          16480.00 20380.00 22820.00 31990.00
                         1000.00         16024.50 16800.00 22695.00 28750.00
                         1395.00         15850.00 17835.00 20900.00 28880.00
...                                           ...      ...      ...      ...
Renault Espace Van       1600.00         22675.00 30650.00 33125.00 35300.00
                         1618.00         25490.00 25490.00 26895.00 63477.00
                         1798.00         31990.00 35990.00 40970.00 64332.00
                         1800.00         50750.00 50750.00 50750.00 50750.00
                         1997.00         32975.00 39625.00 46262.50 56950.00

[296 rows x 8 columns]

In [87]:
fill(df, "make_model", "body_type", "displacement_cc", "mode")

Number of NaN :  0
------------------
1598.00     5044
999.00      2467
1398.00     1387
1399.00      768
1229.00      678
1956.00      670
1461.00      667
1490.00      559
1422.00      467
1197.00      372
898.00       351
1395.00      320
1968.00      301
1149.00      288
1618.00      212
1798.00      210
1498.00      196
1600.00      130
1248.00      110
1997.00      103
1364.00      102
1400.00       90
998.00        72
1500.00       50
2000.00       46
1000.00       40
1.00          36
1998.00       25
2480.00       20
1200.00       18
1984.00       18
1397.00       11
899.00        11
160.00         6
929.00         5
1499.00        5
997.00         4
1596.00        4
139.00         4
900.00         4
1599.00        3
1199.00        3
1396.00        3
1495.00        2
1589.00        2
1300.00        2
2.00           2
995.00         2
1496.00        1
890.00         1
1580.00        1
1995.00        1
1333.00        1
54.00          1
1533.00        1
1100.00        1
1350.00        1
16000.00       1
1856.00        1
1568.00        1
1896.00        1
1584.00        1
996.00         1
1696.00        1
1686.00        1
15898.00       1
1368.00        1
140.00         1
973.00         1
1239.00        1
1369.00        1
1390.00        1
122.00         1
1198.00        1
1195.00        1
2967.00        1
1800.00        1
Name: displacement_cc, dtype: int64

### weight_kg

In [88]:
look_before("weight_kg")

column name    :  weight_kg
--------------------------------
per_of_nulls   :  % 43.81
num_of_nulls   :  6974
num_of_uniques :  434
--------------------------------
NaN        6974
1163.00     574
1360.00     356
1165.00     301
1335.00     242
           ...
1960.00       1
1258.00       1
1167.00       1
1331.00       1
2037.00       1
Name: weight_kg, Length: 435, dtype: int64

In [89]:
df.groupby(["make_model", "body_type","weight_kg"]).price.describe()

                                    count     mean     std      min      25%  \
make_model     body_type weight_kg
Audi A1        Compact   102.00      1.00 19229.00     NaN 19229.00 19229.00
                         1010.00     2.00 15450.00  707.11 14950.00 15200.00
                         1035.00     6.00 16796.67 2617.87 14390.00 15892.50
                         1040.00     2.00 20424.50 2933.79 18350.00 19387.25
                         1065.00    36.00 20971.78 1982.55 15500.00 18987.50
...                                   ...      ...     ...      ...      ...
Renault Espace Van       1975.00     1.00 47580.00     NaN 47580.00 47580.00
                         2037.00     1.00 47950.00     NaN 47950.00 47950.00
                         2353.00     1.00 22990.00     NaN 22990.00 22990.00
                         2410.00     1.00 23990.00     NaN 23990.00 23990.00
                         2471.00     5.00 24738.00 8470.64 17400.00 20900.00

                                        50%      75%      max
make_model     body_type weight_kg
Audi A1        Compact   102.00    19229.00 19229.00 19229.00
                         1010.00   15450.00 15700.00 15950.00
                         1035.00   15900.00 16575.00 21900.00
                         1040.00   20424.50 21461.75 22499.00
                         1065.00   21690.00 22400.00 23550.00
...                                     ...      ...      ...
Renault Espace Van       1975.00   47580.00 47580.00 47580.00
                         2037.00   47950.00 47950.00 47950.00
                         2353.00   22990.00 22990.00 22990.00
                         2410.00   23990.00 23990.00 23990.00
                         2471.00   20900.00 25500.00 38990.00

[890 rows x 8 columns]

In [90]:
fill(df, "make_model", "body_type", "weight_kg", "mode")

Number of NaN :  0
------------------
1163.00    1582
1360.00    1406
1487.00     957
1135.00     828
1425.00     731
           ...
1331.00       1
1132.00       1
1252.00       1
1792.00       1
2037.00       1
Name: weight_kg, Length: 434, dtype: int64

### co2_emission

In [91]:
look_before("co2_emission")

column name    :  co2_emission
--------------------------------
per_of_nulls   :  % 15.3
num_of_nulls   :  2436
num_of_uniques :  122
--------------------------------
NaN        2436
120.00      740
99.00       545
97.00       537
104.00      501
           ...
14.00         1
1060.00       1
51.00         1
165.00        1
193.00        1
Name: co2_emission, Length: 123, dtype: int64

In [92]:
df.groupby(["make_model", "body_type","co2_emission"]).price.describe()

                                       count     mean     std      min  \
make_model     body_type co2_emission
Audi A1        Compact   90.00          1.00 12880.00     NaN 12880.00
                         91.00          5.00 13038.00 1108.93 11800.00
                         92.00          1.00 12479.00     NaN 12479.00
                         94.00          5.00 13960.00 1232.07 12900.00
                         97.00        113.00 15449.59 2445.75 10900.00
...                                      ...      ...     ...      ...
Renault Espace Van       175.00         6.00 36931.67 2811.67 33781.00
                         188.00         1.00 43080.00     NaN 43080.00
                         191.00         2.00 28465.00    0.00 28465.00
                         193.00         1.00 38990.00     NaN 38990.00
                         194.00         1.00 46490.00     NaN 46490.00

                                           25%      50%      75%      max
make_model     body_type co2_emission
Audi A1        Compact   90.00        12880.00 12880.00 12880.00 12880.00
                         91.00        11850.00 13800.00 13800.00 13940.00
                         92.00        12479.00 12479.00 12479.00 12479.00
                         94.00        12900.00 13900.00 14200.00 15900.00
                         97.00        13770.00 15400.00 16700.00 23500.00
...                                        ...      ...      ...      ...
Renault Espace Van       175.00       35630.00 35830.00 38286.75 41480.00
                         188.00       43080.00 43080.00 43080.00 43080.00
                         191.00       28465.00 28465.00 28465.00 28465.00
                         193.00       38990.00 38990.00 38990.00 38990.00
                         194.00       46490.00 46490.00 46490.00 46490.00

[779 rows x 8 columns]

In [93]:
fill(df, "make_model", "body_type", "co2_emission", "median")

Number of NaN :  0
------------------
120.00     850
119.00     694
102.00     689
104.00     679
106.00     615
          ...
80.00        1
990.00       1
1060.00      1
331.00       1
193.00       1
Name: co2_emission, Length: 126, dtype: int64

### comfort_convenience

In [94]:
look_before("comfort_convenience")

column name    :  comfort_convenience
--------------------------------
per_of_nulls   :  % 5.78
num_of_nulls   :  920
num_of_uniques :  6198
--------------------------------
NaN                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  920
Air conditioning,Electrical side mirrors,Hill Holder,Power windows                                                                                                                                                                                                                                                                                                                                                                                                                                   216
Air conditioning,Electrical side mirrors,Power windows                                                                                                                                                                                                                                                                                                                                                                                                                                               134
Air conditioning,Power windows                                                                                                                                                                                                                                                                                                                                                                                                                                                                       130
Air conditioning,Armrest,Automatic climate control,Cruise control,Electrical side mirrors,Leather steering wheel,Light sensor,Lumbar support,Multi-function steering wheel,Navigation system,Park Distance Control,Parking assist system sensors front,Parking assist system sensors rear,Power windows,Rain sensor,Seat heating,Start-stop system                                                                                                                                                   105
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    ...
Air conditioning,Cruise control,Electrical side mirrors,Hill Holder,Leather steering wheel,Light sensor,Multi-function steering wheel,Navigation system,Park Distance Control,Parking assist system sensors rear,Power windows,Rain sensor,Split rear seats,Start-stop system,Tinted windows                                                                                                                                                                                                           1
Air conditioning,Armrest,Automatic climate control,Cruise control,Electrical side mirrors,Heated steering wheel,Hill Holder,Leather steering wheel,Light sensor,Lumbar support,Multi-function steering wheel,Navigation system,Park Distance Control,Parking assist system camera,Parking assist system sensors front,Parking assist system sensors rear,Power windows,Rain sensor,Seat heating,Sunroof                                                                                                1
Air conditioning,Armrest,Cruise control,Electrical side mirrors,Heated steering wheel,Hill Holder,Leather steering wheel,Light sensor,Multi-function steering wheel,Park Distance Control,Parking assist system camera,Parking assist system sensors front,Parking assist system sensors rear,Power windows,Rain sensor,Seat heating,Split rear seats,Start-stop system,Tinted windows                                                                                                                 1
Air conditioning,Automatic climate control,Cruise control,Electrical side mirrors,Leather steering wheel,Light sensor,Multi-function steering wheel,Park Distance Control,Parking assist system sensors front,Parking assist system sensors rear,Power windows,Rain sensor,Seat heating                                                                                                                                                                                                                1
Air conditioning,Automatic climate control,Cruise control,Electrically heated windshield,Electrical side mirrors,Electric tailgate,Heads-up display,Heated steering wheel,Hill Holder,Keyless central door lock,Leather steering wheel,Light sensor,Lumbar support,Navigation system,Park Distance Control,Parking assist system camera,Parking assist system self-steering,Parking assist system sensors front,Parking assist system sensors rear,Power windows,Rain sensor,Seat heating,Sunroof      1
Name: comfort_convenience, Length: 6199, dtype: int64

In [95]:
fill(df, "make_model", "body_type", "comfort_convenience", "mode")

Number of NaN :  0
------------------
Air conditioning,Electrical side mirrors,Hill Holder,Power windows                                                                                                                                                                                                                                                                                                                                                                                                                                   315
Air conditioning,Armrest,Automatic climate control,Cruise control,Electrical side mirrors,Leather steering wheel,Light sensor,Lumbar support,Multi-function steering wheel,Navigation system,Park Distance Control,Parking assist system sensors front,Parking assist system sensors rear,Power windows,Rain sensor,Seat heating,Start-stop system                                                                                                                                                   187
Air conditioning,Automatic climate control,Cruise control,Multi-function steering wheel,Park Distance Control,Power windows                                                                                                                                                                                                                                                                                                                                                                          158
Air conditioning,Electrical side mirrors,Power windows                                                                                                                                                                                                                                                                                                                                                                                                                                               134
Air conditioning,Power windows                                                                                                                                                                                                                                                                                                                                                                                                                                                                       130
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    ...
Air conditioning,Armrest,Cruise control,Electrical side mirrors,Heated steering wheel,Hill Holder,Leather steering wheel,Light sensor,Multi-function steering wheel,Park Distance Control,Parking assist system camera,Parking assist system sensors rear,Power windows,Rain sensor,Seat heating,Split rear seats,Start-stop system,Sunroof,Tinted windows                                                                                                                                             1
Air conditioning,Armrest,Cruise control,Hill Holder,Leather steering wheel,Multi-function steering wheel,Park Distance Control,Parking assist system sensors front,Parking assist system sensors rear,Power windows                                                                                                                                                                                                                                                                                    1
Air conditioning,Armrest,Automatic climate control,Cruise control,Electrical side mirrors,Leather steering wheel,Multi-function steering wheel,Power windows,Rain sensor,Start-stop system,Tinted windows                                                                                                                                                                                                                                                                                              1
Air conditioning,Armrest,Automatic climate control,Cruise control,Electrically adjustable seats,Leather steering wheel,Light sensor,Navigation system,Power windows,Rain sensor                                                                                                                                                                                                                                                                                                                        1
Air conditioning,Automatic climate control,Cruise control,Electrically heated windshield,Electrical side mirrors,Electric tailgate,Heads-up display,Heated steering wheel,Hill Holder,Keyless central door lock,Leather steering wheel,Light sensor,Lumbar support,Navigation system,Park Distance Control,Parking assist system camera,Parking assist system self-steering,Parking assist system sensors front,Parking assist system sensors rear,Power windows,Rain sensor,Seat heating,Sunroof      1
Name: comfort_convenience, Length: 6198, dtype: int64

### entertainment_media

In [96]:
look_before("entertainment_media")

column name    :  entertainment_media
--------------------------------
per_of_nulls   :  % 8.63
num_of_nulls   :  1374
num_of_uniques :  346
--------------------------------
NaN                                                                                                 1374
Bluetooth,Hands-free equipment,On-board computer,Radio,USB                                          1282
Bluetooth,Hands-free equipment,MP3,On-board computer,Radio,USB                                       982
Bluetooth,CD player,Hands-free equipment,MP3,On-board computer,Radio,USB                             783
On-board computer,Radio                                                                              487
                                                                                                    ...
Bluetooth,CD player,Digital radio,Hands-free equipment,Radio                                           1
CD player,Hands-free equipment,MP3,Radio,USB                                                           1
MP3,Radio,Sound system,USB                                                                             1
Bluetooth,MP3,On-board computer,Radio,Television,USB                                                   1
Bluetooth,CD player,Hands-free equipment,MP3,On-board computer,Radio,Sound system,Television,USB       1
Name: entertainment_media, Length: 347, dtype: int64

In [97]:
fill(df, "make_model", "body_type", "entertainment_media", "mode")

Number of NaN :  0
------------------
Bluetooth,Hands-free equipment,On-board computer,Radio,USB                      1639
Bluetooth,Hands-free equipment,MP3,On-board computer,Radio,USB                  1063
Bluetooth,CD player,Hands-free equipment,MP3,On-board computer,Radio,USB        1007
On-board computer                                                                681
Radio                                                                            558
                                                                                ...
Bluetooth,CD player,MP3                                                            1
CD player,USB                                                                      1
Bluetooth,CD player,Digital radio,Radio,USB                                        1
Bluetooth,CD player,Digital radio,MP3,On-board computer,Radio,Television,USB       1
Hands-free equipment,On-board computer,Radio,Sound system                          1
Name: entertainment_media, Length: 346, dtype: int64

### extras

In [98]:
look_before("extras")

column name    :  extras
--------------------------------
per_of_nulls   :  % 18.61
num_of_nulls   :  2962
num_of_uniques :  659
--------------------------------
Alloy wheels                                                                                               3245
NaN                                                                                                        2962
Alloy wheels,Touch screen                                                                                   697
Alloy wheels,Voice Control                                                                                  577
Alloy wheels,Touch screen,Voice Control                                                                     541
                                                                                                           ...
Alloy wheels,Catalytic Converter,Shift paddles,Sport package,Sport seats,Sport suspension,Voice Control       1
Alloy wheels,Catalytic Converter,Roof rack,Sport package,Sport seats,Trailer hitch                            1
Alloy wheels,Catalytic Converter,Ski bag,Sport package,Voice Control                                          1
Catalytic Converter,Roof rack,Sport seats,Sport suspension                                                    1
Alloy wheels,Shift paddles,Ski bag,Sport seats,Sport suspension,Touch screen,Voice Control                    1
Name: extras, Length: 660, dtype: int64

In [99]:
fill(df, "make_model", "body_type", "extras", "mode")

Number of NaN :  0
------------------
Alloy wheels                                                                                               5884
Alloy wheels,Touch screen                                                                                   697
Alloy wheels,Voice Control                                                                                  582
Alloy wheels,Touch screen,Voice Control                                                                     544
Roof rack                                                                                                   538
                                                                                                           ...
Alloy wheels,Catalytic Converter,Shift paddles,Sport package,Sport seats,Sport suspension,Voice Control       1
Alloy wheels,Catalytic Converter,Roof rack,Sport package,Sport seats,Trailer hitch                            1
Alloy wheels,Catalytic Converter,Ski bag,Sport package,Voice Control                                          1
Catalytic Converter,Roof rack,Sport seats,Sport suspension                                                    1
Alloy wheels,Shift paddles,Ski bag,Sport seats,Sport suspension,Touch screen,Voice Control                    1
Name: extras, Length: 659, dtype: int64

### safety_security

In [100]:
look_before("safety_security")

column name    :  safety_security
--------------------------------
per_of_nulls   :  % 6.17
num_of_nulls   :  982
num_of_uniques :  4443
--------------------------------
NaN                                                                                                                                                                                                                                                                                                                                                               982
ABS,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Fog lights,Immobilizer,Isofix,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control                                                                                                                                      538
ABS,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Immobilizer,Isofix,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control                                                                                                                                                 480
ABS,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Immobilizer,Isofix,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control,Xenon headlights                                                                                                                                275
ABS,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Fog lights,Immobilizer,Isofix,LED Daytime Running Lights,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control                                                                                                           272
                                                                                                                                                                                                                                                                                                                                                                 ...
ABS,Central door lock,Electronic stability control,Immobilizer,Isofix,Passenger-side airbag,Power steering,Side airbag                                                                                                                                                                                                                                              1
ABS,Adaptive Cruise Control,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Emergency brake assistant,Immobilizer,Isofix,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control                                                                                                 1
ABS,Adaptive Cruise Control,Alarm system,Central door lock,Driver-side airbag,Electronic stability control,Fog lights,Immobilizer,Isofix,Lane departure warning system,LED Daytime Running Lights,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control,Xenon headlights                                                1
ABS,Adaptive Cruise Control,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Fog lights,Immobilizer,Isofix,Power steering,Tire pressure monitoring system,Traction control                                                                                                                                                  1
ABS,Adaptive Cruise Control,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Emergency brake assistant,Fog lights,Immobilizer,Isofix,Lane departure warning system,LED Daytime Running Lights,LED Headlights,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traffic sign recognition      1
Name: safety_security, Length: 4444, dtype: int64

In [101]:
fill(df, "make_model", "body_type", "safety_security", "mode")

Number of NaN :  0
------------------
ABS,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Fog lights,Immobilizer,Isofix,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control                                                                                                                                      729
ABS,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Immobilizer,Isofix,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control                                                                                                                                                 480
ABS,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Fog lights,Immobilizer,Isofix,LED Daytime Running Lights,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control                                                                                                           373
ABS,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Immobilizer,Isofix,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control,Xenon headlights                                                                                                                                351
ABS,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Isofix,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control                                                                                                                                                             306
                                                                                                                                                                                                                                                                                                                                                                 ...
ABS,Central door lock,Electronic stability control,Immobilizer,Isofix,Passenger-side airbag,Power steering,Side airbag                                                                                                                                                                                                                                              1
ABS,Adaptive Cruise Control,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Emergency brake assistant,Immobilizer,Isofix,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control                                                                                                 1
ABS,Adaptive Cruise Control,Alarm system,Central door lock,Driver-side airbag,Electronic stability control,Fog lights,Immobilizer,Isofix,Lane departure warning system,LED Daytime Running Lights,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traction control,Xenon headlights                                                1
ABS,Adaptive Cruise Control,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Fog lights,Immobilizer,Isofix,Power steering,Tire pressure monitoring system,Traction control                                                                                                                                                  1
ABS,Adaptive Cruise Control,Central door lock,Daytime running lights,Driver-side airbag,Electronic stability control,Emergency brake assistant,Fog lights,Immobilizer,Isofix,Lane departure warning system,LED Daytime Running Lights,LED Headlights,Passenger-side airbag,Power steering,Side airbag,Tire pressure monitoring system,Traffic sign recognition      1
Name: safety_security, Length: 4443, dtype: int64

### cons_comb

In [102]:
look_before("cons_comb")

column name    :  cons_comb
--------------------------------
per_of_nulls   :  % 12.77
num_of_nulls   :  2033
num_of_uniques :  59
--------------------------------
NaN     2033
5.40     770
3.90     733
4.00     717
5.10     657
4.40     623
5.60     618
4.70     602
3.80     585
5.00     552
4.80     546
4.50     523
5.20     454
4.20     435
4.60     426
4.90     393
5.50     380
5.30     380
3.70     369
5.90     369
5.70     342
4.10     342
6.00     331
3.30     307
4.30     307
3.50     288
6.20     216
3.60     194
6.30     181
6.10     175
5.80     164
6.60     148
6.80     136
3.40     106
6.40      75
3.00      73
7.40      66
6.70      43
6.50      43
7.10      38
1.00      37
6.90      27
3.20      25
8.30      20
7.60      14
7.00      10
3.10       7
7.80       6
7.20       6
8.00       5
8.60       4
1.60       3
8.70       3
7.90       3
8.10       2
0.00       2
7.30       2
7.50       1
9.10       1
1.20       1
Name: cons_comb, dtype: int64

In [103]:
cons_comb = (df["cons_country"] + df["cons_city"])/2

In [104]:
df["cons_comb"] = df["cons_comb"].fillna(cons_comb)

In [105]:
df["cons_comb"].value_counts(dropna=False)

NaN     1925
5.40     770
3.90     733
4.00     718
5.10     657
4.40     623
5.60     618
4.70     602
3.80     585
5.00     558
4.80     546
4.50     526
5.20     455
4.60     445
4.20     435
4.90     393
5.50     380
5.30     380
3.70     369
5.90     369
5.70     342
4.10     342
6.00     331
3.30     326
4.30     307
3.50     307
6.20     216
3.60     194
6.30     181
6.10     175
5.80     164
6.60     148
3.40     143
6.80     136
6.40      75
3.00      73
7.40      66
6.70      45
6.50      43
7.10      39
1.00      37
6.90      27
3.20      25
8.30      20
7.60      14
7.00      10
3.10       7
7.80       6
7.20       6
8.00       5
8.60       4
1.60       3
8.70       3
7.90       3
8.10       2
0.00       2
7.30       2
7.50       1
9.10       1
1.20       1
Name: cons_comb, dtype: int64

In [106]:
df.groupby(["make_model", "body_type","cons_comb"]).price.describe()

                                    count     mean     std      min      25%  \
make_model     body_type cons_comb
Audi A1        Compact   1.00        1.00 12990.00     NaN 12990.00 12990.00
                         3.00        4.00 14370.25 4481.39 11100.00 11242.50
                         3.40        6.00 12755.00  900.75 11800.00 11987.50
                         3.50        3.00 14613.00 1848.10 12479.00 14079.50
                         3.60        5.00 13960.00 1232.07 12900.00 12900.00
...                                   ...      ...     ...      ...      ...
Renault Espace Van       6.20       22.00 25804.73 4058.01 18480.00 23050.00
                         6.50        1.00 68320.00     NaN 68320.00 68320.00
                         6.80      115.00 34032.31 7847.72 25490.00 28237.50
                         7.40       60.00 38088.47 6433.34 28975.00 33709.50
                         7.60       14.00 52019.21 7596.27 38990.00 48387.50

                                        50%      75%      max
make_model     body_type cons_comb
Audi A1        Compact   1.00      12990.00 12990.00 12990.00
                         3.00      12840.50 15968.25 20700.00
                         3.40      12640.00 13570.00 13800.00
                         3.50      15680.00 15680.00 15680.00
                         3.60      13900.00 14200.00 15900.00
...                                     ...      ...      ...
Renault Espace Van       6.20      26225.00 27673.75 33800.00
                         6.50      68320.00 68320.00 68320.00
                         6.80      31990.00 37470.00 58950.00
                         7.40      37128.00 39990.00 54500.00
                         7.60      51350.00 54982.00 64332.00

[583 rows x 8 columns]

In [107]:
fill(df, "make_model", "body_type", "cons_comb", "median")

Number of NaN :  0
------------------
4.00    1010
5.60     941
5.40     899
5.00     807
4.70     760
3.90     733
4.50     720
5.10     677
4.40     667
3.80     585
4.20     569
4.80     546
4.90     534
5.30     530
5.20     467
4.60     445
5.50     388
3.70     369
5.90     369
4.10     362
5.70     342
6.00     331
3.30     326
4.30     317
3.50     307
6.20     219
3.60     194
6.30     181
6.10     175
5.80     164
6.60     148
3.40     143
6.80     136
6.40      75
3.00      73
7.40      66
6.70      45
6.50      43
7.10      39
1.00      38
6.90      27
3.20      25
8.30      20
3.45      19
7.60      14
5.15      11
7.00      10
3.10       7
7.20       6
7.80       6
4.75       5
8.00       5
8.60       4
1.60       3
8.70       3
7.90       3
0.00       2
8.10       2
7.30       2
4.30       1
4.55       1
9.10       1
7.50       1
1.20       1
Name: cons_comb, dtype: int64

### cons_country

In [108]:
df.drop("cons_country", axis = 1, inplace = True)

### cons_city

In [109]:
df.drop("cons_city", axis = 1, inplace = True)

### warranty

In [110]:
look_before("warranty")

column name    :  warranty
--------------------------------
per_of_nulls   :  % 69.51
num_of_nulls   :  11066
num_of_uniques :  41
--------------------------------
NaN      11066
12.00     2594
24.00     1118
60.00      401
36.00      279
48.00      149
6.00       125
72.00       59
3.00        33
23.00       11
18.00       10
20.00        7
25.00        6
2.00         5
50.00        4
26.00        4
16.00        4
4.00         3
1.00         3
19.00        3
34.00        3
13.00        3
28.00        2
22.00        2
14.00        2
11.00        2
46.00        2
21.00        2
9.00         2
17.00        2
45.00        2
33.00        1
40.00        1
65.00        1
10.00        1
15.00        1
7.00         1
8.00         1
56.00        1
49.00        1
47.00        1
30.00        1
Name: warranty, dtype: int64

In [111]:
df.groupby(["make_model", "warranty"]).price.describe().sort_values(by = ["make_model", "mean"], ascending=False)

                         count     mean     std      min      25%      50%  \
make_model     warranty
Renault Espace 48.00     14.00 39806.79 8058.50 19490.00 37035.00 40692.50
               16.00      1.00 38890.00     NaN 38890.00 38890.00 38890.00
               45.00      1.00 37950.00     NaN 37950.00 37950.00 37950.00
               23.00      1.00 37600.00     NaN 37600.00 37600.00 37600.00
               25.00      1.00 36498.00     NaN 36498.00 36498.00 36498.00
...                        ...      ...     ...      ...      ...      ...
Audi A1        23.00      2.00 16560.00 6208.40 12170.00 14365.00 16560.00
               47.00      1.00 16370.00     NaN 16370.00 16370.00 16370.00
               49.00      1.00 16270.00     NaN 16270.00 16270.00 16270.00
               46.00      1.00 15980.00     NaN 15980.00 15980.00 15980.00
               26.00      1.00 15840.00     NaN 15840.00 15840.00 15840.00

                             75%      max
make_model     warranty
Renault Espace 48.00    46095.00 47990.00
               16.00    38890.00 38890.00
               45.00    37950.00 37950.00
               23.00    37600.00 37600.00
               25.00    36498.00 36498.00
...                          ...      ...
Audi A1        23.00    18755.00 20950.00
               47.00    16370.00 16370.00
               49.00    16270.00 16270.00
               46.00    15980.00 15980.00
               26.00    15840.00 15840.00

[121 rows x 8 columns]

In [112]:
# There are too many missing values. This column can be dropped:

df.drop("warranty", axis=1, inplace=True)

## Final DataFrame After Handling Missing Values

In [113]:
# There were 33 columns at the begining of the handling mıissing values process.
# There remained 27 features for further analysis.

df.shape

(15919, 27)

In [114]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15919 entries, 0 to 15918
Data columns (total 27 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   make_model           15919 non-null  object
 1   body_type            15919 non-null  object
 2   price                15919 non-null  int64
 3   vat                  15919 non-null  object
 4   km                   15919 non-null  float64
 5   hp_kw                15919 non-null  float64
 6   type                 15919 non-null  object
 7   previous_owners      15919 non-null  float64
 8   inspection_new       15919 non-null  int64
 9   age                  15919 non-null  float64
 10  body_color           15919 non-null  object
 11  paint_type           15919 non-null  object
 12  upholstery_type      15919 non-null  object
 13  nr_of_doors          15919 non-null  float64
 14  nr_of_seats          15919 non-null  float64
 15  gearing_type         15919 non-null  object
 16  displacement_cc      15919 non-null  float64
 17  weight_kg            15919 non-null  float64
 18  drive_chain          15919 non-null  object
 19  fuel                 15919 non-null  object
 20  cons_comb            15919 non-null  float64
 21  co2_emission         15919 non-null  float64
 22  comfort_convenience  15919 non-null  object
 23  entertainment_media  15919 non-null  object
 24  extras               15919 non-null  object
 25  safety_security      15919 non-null  object
 26  gears                15919 non-null  float64
dtypes: float64(11), int64(2), object(14)
memory usage: 3.3+ MB

In [115]:
df.isnull().sum()/df.shape[0]*100

make_model            0.00
body_type             0.00
price                 0.00
vat                   0.00
km                    0.00
hp_kw                 0.00
type                  0.00
previous_owners       0.00
inspection_new        0.00
age                   0.00
body_color            0.00
paint_type            0.00
upholstery_type       0.00
nr_of_doors           0.00
nr_of_seats           0.00
gearing_type          0.00
displacement_cc       0.00
weight_kg             0.00
drive_chain           0.00
fuel                  0.00
cons_comb             0.00
co2_emission          0.00
comfort_convenience   0.00
entertainment_media   0.00
extras                0.00
safety_security       0.00
gears                 0.00
dtype: float64

## The End of Part-2

In [116]:
df.to_csv("scout_filled.csv", index=False)